import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt

X1=np.array([0,5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,91,92,93,94,95,96,97,98,99,100])
X2=np.array([0,5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,91,92,93,94,95,96,97,98,99])
plt.figure()
#准确率accuracy
acc=np.array([0.15407855,0.259818731,0.305135952,0.326283988,0.36858006,0.410876133,0.468277946,0.52265861,0.583081571,0.667673716,0.722054381,0.806646526,0.839879154,0.894259819,
              0.924471299,0.954682779,0.981873112,0.993957704,1,0.993957704,0.993957704,0.990936556,0.975830816,0.957703927,0.948640483,0.933534743,0.885196375,0.858006042,0.84592145])
spec=np.array([0.15407855,0.172297297,0.181494662,0.186131387,0.196153846,0.207317073,0.224669604,0.244019139,0.26984127,0.316770186,0.356643357,0.443478261,0.490384615,0.593023256,0.671052632,
               0.772727273,0.894736842,0.962264151,1,1,1,1,1,1,1,1,1,1])
f1score = np.array([0,0.222222222,0.303030303,0.338278932,0.404558405,0.465753425,0.541666667,0.606965174,0.672985782,0.755555556,0.803418803,0.870967742,0.895463511,0.933333333,0.953271028,0.972477064,0.989169675,0.996415771,
                    1,0.996441281,0.996441281,0.994671403,0.985915493,0.975609756,0.970537262,0.962199313,0.936454849,0.922570016,0.916530278])

plt.plot(X1,acc,color='green',marker='o',label='Accuracy')
# for x,y in zip(X,acc):
#     plt.text(x,y-0.3,y,ha='center',va='bottom',fontsize=8)
plt.plot(X2,spec,color='red',marker='o',label='Specificity')
# for x,y in zip(X,distance_acc):
#     plt.text(x,y,y,ha='center',va='bottom',fontsize=8)
plt.plot(X1,f1score,color='skyblue',marker='o',label='F1-score')

#获取坐标
ax=plt.gca()
#设置x坐标字体大小，名称
# plt.xticks(fontsize=8)
# plt.xticks([1,2,3,4,5],
#            ['Original \n data','PCA \n data','AutoEncoder \n data','PCA\n+Original','AutoEncoder\n+Original'])
my_x_ticks = np.arange(0, 100, 5)
plt.xticks(my_x_ticks)
# plt.ylabel('%')
plt.xlabel('threshold(%)')
plt.legend(loc='lower right')
plt.show()